#!/usr/bin/env python
# -*- coding: utf-8 -*-
# @Date    : 2018/1/11 16:32
# Author: xycfree
# @Descript:

resp_code = {
    'C00000': 'success',
    'C00001': '异常错误',  # Exception 基类
    'C00002': '查询无数据',  # 查询为空
    'C00003': '参数不能为空',  # 参数为空
    'C00004': '数据库连接异常',  # 数据库连接错误
    'C00005': '参数未定义',  # 未定义的参数
    'C00006': '操作系统错误',  # OSError
    'C00007': '输入/输出操作失败',  # IOError

    'C10000': '用户名或者密码错误',
    'C10001': '用户未激活',
    'C10002': '用户暂时锁定, 请20分钟后再试',
    'C10003': '该用户已注册',
    'C10004': '邮箱格式不正确',
    'C10005': '密码长度为8-32位',
    'C10006': '邮箱激活失败'


}

